## Main task:
## TODO:   1. Написать программу, которая реализует LLL-алгоритм

# TODO:   2. На простых примерах убедиться в корректности реализации.
#   Проверить результаты работы в известных математических пакетах,
#   например, Mathematica, Sage и др.

## TODO:   3. Реализовать алгоритм решения аддитивной задачи об укладке
#   ранца на базе LLL-алгоритма. Проанализировать, при каких входных
#   данных алгоритм с наибольшей вероятностью успешно завершается
#   в условиях существования решения.

## TODO:   4. Обосновать полученные результаты.


# my plan
# TODO:
#   - Lattice arithmetic
#   - Output in guman way
#   - Vector arithmetic
#   -
